In [10]:
import numpy as np
import pandas as pd

In [11]:
import os
os.listdir('data/')

['.ipynb_checkpoints',
 'Bike_Data.xlsx',
 'car data.csv',
 'car.csv',
 'Custumer_Data.xlsx',
 'EmployeeDataToClean.xlsx',
 'Emp_Training_Data.xlsx',
 'Orders_Data.xlsx',
 'Orders_Data_2.xlsx',
 'superstore.xlsx',
 't_file.txt']

In [12]:
car = pd.read_csv('data/car.csv')

In [13]:
df = car.copy()

In [14]:
df.head(2)

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000.0,Petrol,Dealer,Manual,0.0
1,sx4,2013,4.75,9.54,43000.0,Diesel,Dealer,Manual,0.0

In [15]:
df.shape

(301, 9)

In [16]:
df.columns

Index(['Car_Name', 'Year', 'Selling_Price', 'Present_Price', 'Kms_Driven',
       'Fuel_Type', 'Seller_Type', 'Transmission', 'Owner'],
      dtype='object')

In [17]:
def rename_columns(d):
    new_columns = {}
    for i in d.columns:
        j=i.lower()
        if ' ' in j:
            j=j.replace(' ','_')
        new_columns[i]=j
    return d.rename(columns=new_columns)

In [19]:
df = rename_columns(df)

In [20]:
df.head()

,car_name,year,selling_price,present_price,kms_driven,fuel_type,seller_type,transmission,owner
0,ritz,2014,3.35,5.59,27000.0,Petrol,Dealer,Manual,0.0
1,sx4,2013,4.75,9.54,43000.0,Diesel,Dealer,Manual,0.0
2,ciaz,2017,7.25,9.85,6900.0,Petrol,Dealer,Manual,0.0
3,wagon r,2011,2.85,4.15,5200.0,Petrol,Dealer,Manual,0.0
4,swift,2014,4.60,6.87,42450.0,Diesel,Dealer,Manual,0.0

In [21]:
df.columns

Index(['car_name', 'year', 'selling_price', 'present_price', 'kms_driven',
       'fuel_type', 'seller_type', 'transmission', 'owner'],
      dtype='object')

In [26]:
df[6:]

,car_name,year,selling_price,present_price,kms_driven,fuel_type,seller_type,transmission,owner
6,NaN,2015,NaN,8.12,NaN,Petrol,NaN,Manual,0.0
7,NaN,2015,NaN,8.61,NaN,Diesel,NaN,Manual,NaN
8,NaN,2016,NaN,8.89,20273.0,Diesel,NaN,Manual,NaN
9,NaN,2015,NaN,8.92,42367.0,Diesel,NaN,Manual,NaN
10,NaN,2017,NaN,3.60,2135.0,Petrol,NaN,Manual,NaN
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988.0,Diesel,Dealer,Manual,0.0
297,brio,2015,4.00,5.90,60000.0,Petrol,Dealer,Manual,0.0
298,city,2009,3.35,11.00,87934.0,Petrol,Dealer,Manual,0.0
299,city,2017,11.50,12.50,9000.0,Diesel,Dealer,Manual,0.0
300,brio,2016,5.30,5.90,5464.0,Petrol,Dealer,Manual,0.0

In [27]:
df.isnull().sum()

car_name         11
year              0
selling_price    12
present_price     9
kms_driven        3
fuel_type         5
seller_type      12
transmission      0
owner             5
dtype: int64

In [29]:
df.isna().sum()

car_name         11
year              0
selling_price    12
present_price     9
kms_driven        3
fuel_type         5
seller_type      12
transmission      0
owner             5
dtype: int64

In [31]:
df.car_name.isna().sum()

11

In [36]:
#get percentage of missing values for all the columns
for i in df.columns:
   print(i, (df[i].isna().sum()/df[ib].count())*100)

car_name 3.793103448275862
year 0.0
selling_price 4.1522491349480966
present_price 3.0821917808219177
kms_driven 1.006711409395973
fuel_type 1.6891891891891893
seller_type 4.1522491349480966
transmission 0.0
owner 1.6891891891891893

In [40]:
#impute missing values
#missing values>75% --- just drop 
# mssing 30 to 75 % ---ask client to restore data
# if <30---impute it

In [96]:
data = {'name':['Kamal','Sarab','Param','Raman','Bubby'],'age': [26, 25, 20, 32,None],'salary':[10000, None, 5000, None, 3000],'dept':['HR', None, 'HR', 'IT','HR']}

In [97]:
df = pd.DataFrame(data)

In [98]:
df

    name   age   salary  dept
0  Kamal  26.0  10000.0    HR
1  Sarab  25.0      NaN  None
2  Param  20.0   5000.0    HR
3  Raman  32.0      NaN    IT
4  Bubby   NaN   3000.0    HR

In [99]:
df.isna().sum()

name      0
age       1
salary    2
dept      1
dtype: int64

In [100]:
df.age.fillna(df['age'].mean(),inplace=True)

In [101]:
df

    name    age   salary  dept
0  Kamal  26.00  10000.0    HR
1  Sarab  25.00      NaN  None
2  Param  20.00   5000.0    HR
3  Raman  32.00      NaN    IT
4  Bubby  25.75   3000.0    HR

In [102]:
df.salary.fillna(df.salary.median(),inplace=True)

In [103]:
df

    name    age   salary  dept
0  Kamal  26.00  10000.0    HR
1  Sarab  25.00   5000.0  None
2  Param  20.00   5000.0    HR
3  Raman  32.00   5000.0    IT
4  Bubby  25.75   3000.0    HR

In [112]:
df.dept.mode()

0    HR
Name: dept, dtype: object

In [113]:
df['dept'].fillna(df['dept'].mode()[0],inplace=True)

In [114]:
df

    name    age   salary dept
0  Kamal  26.00  10000.0   HR
1  Sarab  25.00   5000.0   HR
2  Param  20.00   5000.0   HR
3  Raman  32.00   5000.0   IT
4  Bubby  25.75   3000.0   HR